The number of vertices in this shape, always equal to NumberOfSegments + 1.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public int NumberOfVertices { get; }
  Visual Basic
Public ReadOnly Property NumberOfVertices As Integer
	Get
  Visual C++
public:
property int NumberOfVertices {
	int get ();
}
 See Also
  RebarShapeDefinitionBySegments Class
  Autodesk.Revit.DB.Structure Namespace